            "State Short": "OK",
            "Observed.1  ": "",
            "Date": "24",
            "YEAR 4": "1990.0",
            "Gallons of ethanol per capita age 14 and older": "18597",
            "YEAR 1": "1972.0",
            "Class": "Class B",
            "YEAR 3": "1989.0",
            "Multiple Witnesses": "True",
            "EventId": "W-7766803",
            "Also Noticed": "The rustling and pausing before the tree was pushed over.",
            "jaccard_score": 0.0007371118822435417,
            "Submitted Date Time": "2018-03-27",
            "Location Details ": "Paul's Valley lake off of E 1530 Rd at N 3250 Rd.  North side of lake.",
            "Gallons of ethanol derived from time-varying ABV": "5929493",
            "index": "269319.0",
            "State Resident Population": "3959353",
            "Other Stories": "I've heard there had been some tracks found at some point but that was years ago.",
            "Formatted Address": "Garvin, OK, USA",
            "Nearest Road": "I-35",
            "Witness Count": "3",
            "Month": "March",
            "Fixed Year": "2018",
            "Population (age 21 and older)": "2826916",
            "LocationLng": "-97.22329999999998",
            "State Population Density": "57.7",
            "foot size.3": "s",
            "Gallons of ethanol (absolute alcohol)": "5948579",
            "MAMMAL 3": "Raccoon",
            "ZipCode": "73075.0",
            "foot size": "b",
            "LocationLat": "34.7111",
            "Observed": "On the evening of 3/24/18 my wife, my youngest son, and I was fishing at Paul's Valley lake. We had been there 30 mins or so fishing when I decided to rig a bass line. I had paused cause I heard some rustling in the woods across the road from us. My wife asked what was wrong I answered nothing just some noise. I know there is big cats in the area but I felt as if we was being watched not the first time at this spot to feel that way. Well this day it was odd the noise was rustling and then we went back to fishing. I went to change bait for my bass pole when it happened again. Then as we was talking another noise happened then we all watched a tree of good size push to the side then fall. She looked at me in awe, I said to them load up there is only one creature that pushes trees that big over. No bears are in this area. As they loaded I kept watching the woods for movement. They was done asking me to let in and let us leave.",
            "YEAR 2": "2006.0",
            "Follow-Up Report": "I spoke to the witness who I will call Joe over the phone.  He his wife and their son aged 11 at the time were bank fishing at a pond.  They had been there for about 30 minutes and had caught a few small fish but thrown them back.  They heard a rustling in the brush across the road behind them.  At this point, Joe starts to feel the hair on the back of his neck stand up.  He asked his wife if the hair on her neck was standing up too?  She replied that they were.  He commented that his wife in Native American and her senses in nature are far superior to his. He said to her that \u0093Something is looking at us really hard\u0094.   He noticed a smell with some skunk undertones to it.   His son came over and asked him if something was wrong.  He said, \u0093No, but if I tell you to get in the truck we are leaving, just do it\u0094.Joe was starting to run a little low on bait, so he went up to his pick up to get some more.  While he was up there and to ease his nerves a bit, he joking said toward the brush, \u0093The first fish we catch I will give it to you.\u0094   On the short walk back to the fishing area, he heard a low grunt/growl sort of a MMMMMMM sound.  His wife asked if he made that noise and he said, no.  The grunt unnerved them both even more.  They decided to pack up and leave the area as they were packing they heard a large branch break.  That was it.  He told them to get in the truck as they were getting in the truck he looked over at the brush and saw a large (10 inch diameter estimated) tree pushed over and it fell.   They got in the truck and left immediately.  His wife commented as they were leaving, \u0093I am glad you decided to leave because if you didn\u0092t leave I was going to leave you there\u0094.   The brush was very thick so he never saw the creature.  A quick look at past reports also suggests that the general area has had several reports over the last several years as the Canadian River runs through the area. ",
            "StartTime": "2018-03",
            "Year": "2018",
            "foot size.1": "s",
            "National Park Visitation Count": "1506887.0",
            "Time And Conditions": "Early Evening and a bit chilly",
            "Location": "(33.9539972, -94.9424443)"
        },
        {
            "City": "Oklahoma City",
            "MAMMAL 4": "White-tailed deer",
            "Severity": "Light",
            "Author": "",
            "Headline": "Hiker\u0092s dusk sighting in Stinchcomb Wilfdlife Refuge (OKC)",
            "Other Witnesses": "Myself.",
            "Precipitation(in)": "0.2069182389937106",
            "Media Issue": "",
            "MAMMAL 2": "Mexican free-tailed bat",
            "Environment": "Wildlife refuge park located on the suburbs of Oklahoma City and Yukon.",
            "Report Type": "Report",
            "State": "Oklahoma",
            "Population (age 14 and older)": "3218671",
            "Decile for per capita consumption age 21 and older": "0",
            "A & G References": "",
            "Gallons of ethanol per capita age 21 and older": "870",
            "ZipCode": "73159.0",
            "TimeZone": "US/Central",
            "EndTime": "2019-04",
            "Type": "Rain",
            "Decile for per capita consumption age 14 and older": "0",
            "Time And Conditions": "2019-04-15 00:00:00",
            "foot size.2": "s",
            "Follow-Up": "Follow-up investigation report by BFRO Investigator Matthew Moneymaker",
            "Season": "Spring",
            "Submitted Date": "2021-04-10 00:00:00",
            "Year-Month": "2019-04",
            "Nearest NP": "Virgin Islands NP",
            "Census Rank": "37",
            "id": "bc347ad0-3ec5-4e51-881b-2d252a626192",
            "Submitted Year": "2021",
            "BigFoot Hotspot": "False",
            "Source Url": "",
            "Nearest Town  ": "Oklahoma City, OK",
            "Multiple Witnesses": "False",
            "State Short": "OK",
            "State Resident Population": "3959353",
            "Date": "15",
            "YEAR 4": "1990.0",
            "Gallons of ethanol per capita age 14 and older": "18453",
            "YEAR 1": "1972.0",
            "Class": "Class A",
            "YEAR 3": "1989.0",
            "YEAR 2": "2006.0",
            "EventId": "W-4650749",
            "Also Noticed": "The week prior I saw a homeless women making camp in the woods. Her hair was messy so I initially thought this was her at first. However, this was 1 mile downriver from where I saw the creature.",
            "jaccard_score": 0.000725771699439795,
            "Submitted Date Time": "2021-04-10",
            "Location Details ": "When I lived in NW Oklahoma City, I would frequently take evening walks at Stinchcomb Wildlife Refuge. The preserve is roughly 1000-acres located on the suburbs of Oklahoma City and Yukon adjacent to the Wiley Post Airport. Beginning from the parking lot at end of NW 50th street, the maintenance road will take you 2.5 miles upriver to the Kilpatrick bridge, where the N. Canadian river enters the reserve. However, the city only maintains the trail to the remote communication building, from there the trail becomes overgrown in the summers. The park is typically visited by local neighbors, bicyclists, horseback riders, and dog lovers.",
            "Gallons of ethanol derived from time-varying ABV": "5897417",
            "Observed": "This evening, I decided to venture pass the communication building as the foliage was still at ease. I continued another ½ mile up the path to where the powerlines cross the river, from here the river bank drops 15ft, giving a nice view of the river below. As I approached this area, my eyes were immediately caught by someone down below at the river edge. What I saw was an all-black figure down at the river edge about 250ft away. I thought it was strange because not many people hike off trail into the preserve during the summers nor late in the evening or even pass the communication building. As I watched this \u0093man\u0094 down at the river bank, I started to notice settle detail like golden-red hair in the sunset. I also didn\u0092t notice any distinct clothing but hair alone. At this moment I remember being very confuse to what I was seeing. Whoever was down at the river, began to walk inland using it\u0092s arms to move the reed bushes. That I saw it\u0092s long hair dangling from its arm, shoulder to hand. \u0093Omg, it\u0092s bigfoot\u0094 I thought. I immediately began to reach for my phone without taking my eyes off the creature, that is when it noticed me. What terrified me the most was not able to make out any details in the face as we made eye contact. That is when I ran. I continued to ran until I met a couple with their dog back at the communication building. I will never forget the look of confusion on their faces when I came sprinting around the corner. I wanted to tell them about my experience but I continued to run as I thought they would not believe me. The following day I returned to look for footprints but was unable to venture into the overgrown foliage. The experience was not enough to scary me away completely, instead I was more cautious of the time of day and surroundings. I continued to exercise at Stinchcomb until I moved to AZ in July 2019.",
            "Observed.1  ": "",
            "Media Source": "",
            "Other Stories": "I have been told by my coworker as he knows I frequently walk the trails. Also there is rumors of tree structures deep in the reserve. But these could have been built by teenagers who live in the nearby neighborhood. As I have seen many adolescents with their friends exploring the woods.",
            "Formatted Address": "Rivers Trl, Oklahoma City, OK 73131, USA",
            "Nearest Road": "River Road (dirt hiking path)",
            "Witness Count": "1",
